#+TITLE: Kubernetes CKAD
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
*** List the nginx pod with custom columns POD_NAME POD_STATUS
#+BEGIN_SRC shell
kubectl get po -o=custom-columns='POD_NAME:.metadata.name, POD_STATUS:.status.containerStatuses[].state'
#+END_SRC

#+RESULTS:
| POD_NAME     | POD_STATUS                                                                                               |              |                                 |              |                                  |
| nginx        | map[running:map[startedAt:2020-10-20T07:29:32Z]]                                                         |              |                                 |              |                                  |
| nginx2       | map[terminated:map[containerID:docker://db3b1fc303903f6f8d2468862cba9421b3b48317574c1fb2d89f1a294c8e9fa7 | exitCode:127 | finishedAt:2020-10-20T06:23:10Z | reason:Error | startedAt:2020-10-20T06:23:10Z]] |
| pod-readines | map[running:map[startedAt:2020-10-20T05:49:57Z]]                                                         |              |                                 |              |                                  |
| test         | map[running:map[startedAt:2020-10-20T05:50:00Z]]                                                         |              |                                 |              |                                  |

*** Get pods with labels
#+BEGIN_SRC shell
kubectl get pods --show-labels
#+END_SRC

#+RESULTS:
| NAME         | READY | STATUS  | RESTARTS | AGE   | LABELS           |
| nginx        | 1/1   | Running |        0 | 73m   | run=nginx        |
| nginx2       | 0/1   | Error   |        0 | 139m  | run=nginx2       |
| pod-readines | 1/1   | Running |        1 | 3d16h | run=pod-readines |
| test         | 1/1   | Running |        1 | 3d17h | run=test         |

**** 29
#+BEGIN_SRC shell :results output
cd ./testfiles/
kubectl run busybox --image=busybox --dry-run=client -o yaml > mc.yaml
cat mc.yaml
ls
#+END_SRC

#+RESULTS:
#+begin_example
apiVersion: v1
kind: Pod
metadata:
creationTimestamp: null
labels:
run: busybox
name: busybox
spec:
containers:
- image: busybox
name: busybox
resources: {}
dnsPolicy: ClusterFirst
restartPolicy: Always
status: {}
mc.yaml
#+end_example


complete multipod file
#+BEGIN_SRC yaml
apiVersion: v1
kind: Pod
metadata:
creationTimestamp: null
labels:
run: busybox
name: busybox
spec:
containers:
- args:
- bin/sh
- -c
- echo Hello word;sleep 3600
image: busybox
name: busybox1
resources: {}
- args:
- bin/sh
- -c
- echo Hello world;sleep 3600
image: busybox
name: busybox2
- args:
- bin/sh
- -c
- echo this is third container ;sleep 3600
image: busybox
name: busybox3
dnsPolicy: ClusterFirst
restartPolicy: Always
status: {}
#+END_SRC

#+BEGIN_SRC shell :results output
kubectl create -f  mc.yaml
#+END_SRC

#+RESULTS:
: pod/busybox created

#+BEGIN_SRC shell :results output
kubectl describe po busybox
#+END_SRC

#+RESULTS:
#+begin_example
Name:         busybox
Namespace:    default
Priority:     0
Node:         minikube/172.17.0.2
Start Time:   Tue, 20 Oct 2020 11:41:35 +0200
Labels:       run=busybox
Annotations:  <none>
Status:       Running
IP:           172.18.0.6
IPs:
IP:  172.18.0.6
Containers:
busybox1:
Container ID:  docker://a8a84bb695b64a75103ee7f896d9333abed7492a941627fd246c15bcbbfedc6f
Image:         busybox
Image ID:      docker-pullable://busybox@sha256:a9286defaba7b3a519d585ba0e37d0b2cbee74ebfe590960b0b1d6a5e97d1e1d
Port:          <none>
Host Port:     <none>
Args:
    bin/sh
    -c
    echo Hello word;sleep 3600
State:          Running
    Started:      Tue, 20 Oct 2020 11:41:38 +0200
Ready:          True
Restart Count:  0
Environment:    <none>
Mounts:
    /var/run/secrets/kubernetes.io/serviceaccount from default-token-qpgrj (ro)
busybox2:
Container ID:  docker://7bf844d973e73bdeee3cf907fabb98e0f825457d328d8c9d7fa1da38e365f40c
Image:         busybox
Image ID:      docker-pullable://busybox@sha256:a9286defaba7b3a519d585ba0e37d0b2cbee74ebfe590960b0b1d6a5e97d1e1d
Port:          <none>
Host Port:     <none>
Args:
    bin/sh
    -c
    echo Hello world;sleep 3600
State:          Running
    Started:      Tue, 20 Oct 2020 11:41:40 +0200
Ready:          True
Restart Count:  0
Environment:    <none>
Mounts:
    /var/run/secrets/kubernetes.io/serviceaccount from default-token-qpgrj (ro)
busybox3:
Container ID:  docker://5b7c2909ee0d1cae50aa5d03a853032b00d0fd23558ec156f13076ef33e62b1c
Image:         busybox
Image ID:      docker-pullable://busybox@sha256:a9286defaba7b3a519d585ba0e37d0b2cbee74ebfe590960b0b1d6a5e97d1e1d
Port:          <none>
Host Port:     <none>
Args:
    bin/sh
    -c
    echo this is third container ;sleep 3600
State:          Running
    Started:      Tue, 20 Oct 2020 11:41:42 +0200
Ready:          True
Restart Count:  0
Environment:    <none>
Mounts:
    /var/run/secrets/kubernetes.io/serviceaccount from default-token-qpgrj (ro)
Conditions:
Type              Status
Initialized       True
Ready             True
ContainersReady   True
PodScheduled      True
Volumes:
default-token-qpgrj:
Type:        Secret (a volume populated by a Secret)
SecretName:  default-token-qpgrj
Optional:    false
QoS Class:       BestEffort
Node-Selectors:  <none>
Tolerations:     node.kubernetes.io/not-ready:NoExecute for 300s
                node.kubernetes.io/unreachable:NoExecute for 300s
Events:
Type    Reason     Age        From               Message
----    ------     ----       ----               -------
Normal  Scheduled  <unknown>                     Successfully assigned default/busybox to minikube
Normal  Pulling    47s        kubelet, minikube  Pulling image "busybox"
Normal  Pulled     45s        kubelet, minikube  Successfully pulled image "busybox" in 2.055967s
Normal  Created    45s        kubelet, minikube  Created container busybox1
Normal  Started    45s        kubelet, minikube  Started container busybox1
Normal  Pulling    45s        kubelet, minikube  Pulling image "busybox"
Normal  Pulled     43s        kubelet, minikube  Successfully pulled image "busybox" in 1.9051111s
Normal  Created    43s        kubelet, minikube  Created container busybox2
Normal  Started    43s        kubelet, minikube  Started container busybox2
Normal  Pulling    43s        kubelet, minikube  Pulling image "busybox"
Normal  Pulled     41s        kubelet, minikube  Successfully pulled image "busybox" in 2.1070341s
Normal  Created    41s        kubelet, minikube  Created container busybox3
Normal  Started    41s        kubelet, minikube  Started container busybox3
#+end_example

**** 30
#+BEGIN_SRC shell
kubectl logs busybox -c busybox1
#+END_SRC

#+RESULTS:
: Hello word

#+BEGIN_SRC shell
kubectl logs busybox -c busybox3
#+END_SRC

#+RESULTS:
: this is third container

**** 32 Run the command in the third container
#+BEGIN_SRC shell :results output
kubectl exec busybox -c busybox3  -- ls
#+END_SRC

#+RESULTS:
#+begin_example
bin
dev
etc
home
proc
root
sys
tmp
usr
var
#+end_example
**** 34 Create pod with sidecar container
#+BEGIN_SRC shell :results output
cd testfiles
kubectl run busybox_sidecar --image=busybox  --dry-run=client -o yaml -- bin/sh -c "while true;do echo 'Hi I am from Main Container' >> /var/log/index.html;sleep 5;done"> busybox_sidecar.yml
cat busybox_sidecar.yml
#+END_SRC

#+RESULTS:
#+begin_example
apiVersion: v1
kind: Pod
metadata:
creationTimestamp: null
labels:
run: busybox_sidecar
name: busybox_sidecar
spec:
containers:
- args:
- bin/sh
- -c
- while true;do echo 'Hi I am from Main Container' >> /var/log/index.html;sleep
    5;done
image: busybox
name: busybox_sidecar
resources: {}
dnsPolicy: ClusterFirst
restartPolicy: Always
status: {}
#+end_example

- [ ] ToDo How to impl. Sidecar and Embassador pattern exactly

#+BEGIN_SRC shell :results output
cd testfiles
kubectl create -f busybox_sidecar.yml
#+END_SRC

#+RESULTS:
: pod/busybox-sidecar created

#+BEGIN_SRC shell :results output
kubectl describe po busybox-sidecar
#+END_SRC

#+RESULTS:
#+begin_example
Name:         busybox-sidecar
Namespace:    default
Priority:     0
Node:         minikube/172.17.0.2
Start Time:   Tue, 20 Oct 2020 14:25:52 +0200
Labels:       run=busybox-sidecar
Annotations:  <none>
Status:       Running
IP:           172.18.0.8
IPs:
IP:  172.18.0.8
Containers:
sidecar-container:
    Container ID:   docker://34ee9fd9e1a8c216fd585581e86731050378dd3f5471e791a2bcba62a0ace328
    Image:          nginx
    Image ID:       docker-pullable://nginx@sha256:ed7f815851b5299f616220a63edac69a4cc200e7f536a56e421988da82e44ed8
    Port:           80/TCP
    Host Port:      0/TCP
    State:          Running
    Started:      Tue, 20 Oct 2020 14:25:55 +0200
    Ready:          True
    Restart Count:  0
    Environment:    <none>
    Mounts:
    /usr/share/nginx/html from var-logs (rw)
    /var/run/secrets/kubernetes.io/serviceaccount from default-token-qpgrj (ro)
main-container:
    Container ID:  docker://163038776eb6f9ee5591aa4ec5a4d0b56397366c5dad505b57a746a51202029a
    Image:         busybox
    Image ID:      docker-pullable://busybox@sha256:a9286defaba7b3a519d585ba0e37d0b2cbee74ebfe590960b0b1d6a5e97d1e1d
    Port:          <none>
    Host Port:     <none>
    Args:
    bin/sh
    -c
    while true; do
        echo 'Hi I am from Main Container' >> /var/log/index.html;
        sleep 5;
    done

    State:          Running
    Started:      Tue, 20 Oct 2020 14:25:57 +0200
    Ready:          True
    Restart Count:  0
    Environment:    <none>
    Mounts:
    /var/logs from var-logs (rw)
    /var/run/secrets/kubernetes.io/serviceaccount from default-token-qpgrj (ro)
Conditions:
Type              Status
Initialized       True
Ready             True
ContainersReady   True
PodScheduled      True
Volumes:
var-logs:
    Type:       EmptyDir (a temporary directory that shares a pod's lifetime)
    Medium:
    SizeLimit:  <unset>
default-token-qpgrj:
    Type:        Secret (a volume populated by a Secret)
    SecretName:  default-token-qpgrj
    Optional:    false
QoS Class:       BestEffort
Node-Selectors:  <none>
Tolerations:     node.kubernetes.io/not-ready:NoExecute for 300s
                node.kubernetes.io/unreachable:NoExecute for 300s
Events:
Type    Reason     Age        From               Message
----    ------     ----       ----               -------
Normal  Scheduled  <unknown>                     Successfully assigned default/busybox-sidecar to minikube
Normal  Pulling    2m8s       kubelet, minikube  Pulling image "nginx"
Normal  Pulled     2m5s       kubelet, minikube  Successfully pulled image "nginx" in 2.3070851s
Normal  Created    2m5s       kubelet, minikube  Created container sidecar-container
Normal  Started    2m5s       kubelet, minikube  Started container sidecar-container
Normal  Pulling    2m5s       kubelet, minikube  Pulling image "busybox"
Normal  Pulled     2m3s       kubelet, minikube  Successfully pulled image "busybox" in 2.3570642s
Normal  Created    2m3s       kubelet, minikube  Created container main-container
Normal  Started    2m3s       kubelet, minikube  Started container main-container
#+end_example

**** 36 Pods with label information
#+BEGIN_SRC shell :result output
kubectl get pods --show-labels
#+END_SRC

#+RESULTS:
| NAME            | READY | STATUS  | RESTARTS | AGE   | LABELS              |
| busybox         | 3/3   | Running |       15 | 5h32m | run=busybox         |
| busybox-sidecar | 2/2   | Running |        0 | 168m  | run=busybox-sidecar |
| counter         | 3/3   | Running |        0 | 174m  | <none>              |
| nginx           | 1/1   | Running |        0 | 7h44m | run=nginx           |
| nginx-dev1      | 1/1   | Running |        0 | 8m6s  | env=dev             |
| nginx-dev2      | 1/1   | Running |        0 | 8m6s  | env=dev             |
| nginx-dev3      | 1/1   | Running |        0 | 8m6s  | env=dev             |
| nginx2          | 0/1   | Error   |        0 | 8h    | run=nginx2          |
| pod-readines    | 1/1   | Running |        1 | 3d23h | run=pod-readines    |
| test            | 1/1   | Running |        1 | 4d    | run=test            |

**** 37 Create nginx pods
- create pods
#+BEGIN_SRC shell :results output
kubectl run nginx-dev1 --image=nginx --labels=env=dev
kubectl run nginx-dev2 --image=nginx --labels=env=dev
kubectl run nginx-dev3 --image=nginx --labels=env=dev
#+END_SRC

#+RESULTS:
: pod/nginx-dev1 created
: pod/nginx-dev2 created
: pod/nginx-dev3 created

- verify pod labels
#+BEGIN_SRC shell :results output
kubectl get pods --show-labels
#+END_SRC

#+RESULTS:
#+begin_example
NAME              READY   STATUS    RESTARTS   AGE     LABELS
busybox           3/3     Running   15         5h26m   run=busybox
busybox-sidecar   2/2     Running   0          162m    run=busybox-sidecar
counter           3/3     Running   0          168m    <none>
nginx             1/1     Running   0          7h38m   run=nginx
nginx-dev1        1/1     Running   0          115s    env=dev
nginx-dev2        1/1     Running   0          115s    env=dev
nginx-dev3        1/1     Running   0          115s    env=dev
nginx2            0/1     Error     0          8h      run=nginx2
pod-readines      1/1     Running   1          3d22h   run=pod-readines
test              1/1     Running   1          4d      run=test
#+end_example

- filter labels
#+BEGIN_SRC shell :results output
kubectl get pods -l env=dev
#+END_SRC

#+RESULTS:
: NAME         READY   STATUS    RESTARTS   AGE
: nginx-dev1   1/1     Running   0          6m19s
: nginx-dev2   1/1     Running   0          6m19s
: nginx-dev3   1/1     Running   0          6m19s

- change label
#+BEGIN_SRC shell :results output
kubectl label pod nginx-dev3 env=uat --overwrite
kubectl get pods --show-labels
#+END_SRC

